updated colors
